In [2]:
import pandas as pd

movies = pd.read_csv('csv/b3/movies.csv')
display(movies)

ratings = pd.read_csv('csv/b3/ratings.csv')
display(ratings)

min_rating = min(ratings['rating'])
print('minimal rating: ' + str(min_rating))
max_rating = max(ratings['rating'])
print('maximum rating: ' + str(max_rating))

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

minimal rating: 0.5
maximum rating: 5.0

In [2]:
joined = ratings.merge(movies, on='movieId', how='left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [4]:
movies.drop_duplicates(subset = 'movieId', keep = 'first', inplace = True)
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
items_dict = {
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 
    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],
    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]
}
purchase_log = {
    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 
    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]
}
items_df = pd.DataFrame(items_dict)
purchase_df = pd.DataFrame(purchase_log)
print(items_df)
print(purchase_df)

   item_id   vendor  stock_count
0   417283  Samsung           54
1   849734       LG           33
2   132223    Apple          122
3   573943    Apple           18
4    19475       LG          102
5  3294095    Apple           43
6   382043  Samsung           77
7   302948  Samsung          143
8   100132       LG           60
9   312394      ZTE           19
   purchase_id  item_id  price
0          101   417283  13900
1          101   849734   5330
2          101   132223  38200
3          112   573943  49990
4          121    19475   9890
5          145  3294095  33000
6          145   382043  67500
7          145   302948  34500
8          145   103845  89900
9          221   100132  11400

In [13]:
# 3.10.1
# Объедините получившиеся датафреймы по столбцу item_id с типом outer.
# Определите, модель с каким item_id есть в статистике продаж purchase_df, но не учтена на складе 
# (подсказка: подумайте, какой датафрейм должен быть "левым", а какой "правым", чтобы получить необходимые данные). 
# Введите ответ в виде целого числа.
items = items_df.merge(purchase_df, on='item_id', how='outer')
display(items)
items[pd.isna(items['stock_count'])]

    item_id   vendor  stock_count  purchase_id    price
0    417283  Samsung         54.0        101.0  13900.0
1    849734       LG         33.0        101.0   5330.0
2    132223    Apple        122.0        101.0  38200.0
3    573943    Apple         18.0        112.0  49990.0
4     19475       LG        102.0        121.0   9890.0
5   3294095    Apple         43.0        145.0  33000.0
6    382043  Samsung         77.0        145.0  67500.0
7    302948  Samsung        143.0        145.0  34500.0
8    100132       LG         60.0        221.0  11400.0
9    312394      ZTE         19.0          NaN      NaN
10   103845      NaN          NaN        145.0  89900.0

    item_id vendor  stock_count  purchase_id    price
10   103845    NaN          NaN        145.0  89900.0

In [12]:
# 3.10.2
# Решите обратную задачу: модель с каким item_id есть на складе, но не имела ни одной продажи? 
# Введите ответ в виде целого числа.
items[pd.isna(items['purchase_id'])]

   item_id vendor  stock_count  purchase_id  price
9   312394    ZTE         19.0          NaN    NaN

In [85]:
# 3.10.3
# Сформируйте датафрейм merged, в котором в результате объединения purchase_df и items_df останутся модели, 
# которые учтены на складе и имели продажи. Сколько всего таких моделей?
sellable = items[(False == pd.isna(items['stock_count'])) & (False == pd.isna(items['purchase_id']))]
print(sellable)
len(sellable)

   item_id   vendor  stock_count  purchase_id    price
0   417283  Samsung         54.0        101.0  13900.0
1   849734       LG         33.0        101.0   5330.0
2   132223    Apple        122.0        101.0  38200.0
3   573943    Apple         18.0        112.0  49990.0
4    19475       LG        102.0        121.0   9890.0
5  3294095    Apple         43.0        145.0  33000.0
6   382043  Samsung         77.0        145.0  67500.0
7   302948  Samsung        143.0        145.0  34500.0
8   100132       LG         60.0        221.0  11400.0

9

In [90]:
# 3.10.4
# Посчитайте объем выручки для каждой модели, которую можно получить, распродав все остатки на складе. 
# Модель с каким item_id имеет максимальное значение выручки после распродажи остатков? 
# Ответ дайте в виде целого числа.
# Примечание: перемножение столбцов датафрейма можно производить разными способами, 
# но самый простой - перемножение "в лоб" вида df['col1'] = df['col2'] * df['col3']. 
# Для присоединения новых данных к датафрейму тоже можно использовать различные методы, 
# включая функцию .append(), которая позволяет присоединять к датафрейму другой датафрейм, серии или словари.
print(sellable)
sellable['potential_profit'] = sellable.stock_count * sellable.price
print(sellable)
sellable = sellable.sort_values(by=['potential_profit'], ascending=False)
sellable.iloc[0]

   item_id   vendor  stock_count  purchase_id    price  potential_profit
0   417283  Samsung         54.0        101.0  13900.0          750600.0
1   849734       LG         33.0        101.0   5330.0          175890.0
2   132223    Apple        122.0        101.0  38200.0         4660400.0
3   573943    Apple         18.0        112.0  49990.0          899820.0
4    19475       LG        102.0        121.0   9890.0         1008780.0
5  3294095    Apple         43.0        145.0  33000.0         1419000.0
6   382043  Samsung         77.0        145.0  67500.0         5197500.0
7   302948  Samsung        143.0        145.0  34500.0         4933500.0
8   100132       LG         60.0        221.0  11400.0          684000.0
   item_id   vendor  stock_count  purchase_id    price  potential_profit
0   417283  Samsung         54.0        101.0  13900.0          750600.0
1   849734       LG         33.0        101.0   5330.0          175890.0
2   132223    Apple        122.0        101.0  38200.0         4660400.0
3   573943    Apple         18.0        112.0  49990.0          899820.0
4    19475       LG        102.0        121.0   9890.0         1008780.0
5  3294095    Apple         43.0        145.0  33000.0         1419000.0
6   382043  Samsung         77.0        145.0  67500.0         5197500.0
7   302948  Samsung        143.0        145.0  34500.0         4933500.0
8   100132       LG         60.0        221.0  11400.0          684000.0

/Users/inikki/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # Remove the CWD from sys.path while we load stuff.

item_id                 382043
vendor                 Samsung
stock_count                 77
purchase_id                145
price                    67500
potential_profit    5.1975e+06
Name: 6, dtype: object

In [91]:
# 3.10.5
# Посчитайте итоговую выручку из прошлого задания по всем моделям. Ответ дайте в виде целого числа.
sum(sellable['potential_profit'])

19729490.0

In [3]:
import os
files = os.listdir('csv/b3/data')
files

['ratings_1.txt',
 'ratings_10.txt',
 'ratings_2.txt',
 'ratings_3.txt',
 'ratings_4.txt',
 'ratings_5.txt',
 'ratings_6.txt',
 'ratings_7.txt',
 'ratings_8.txt',
 'ratings_9.txt']

In [93]:
# 3.11
# После чтения папки список файлов оказался следующим:
# files = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']
# Создайте на основе списка files новый список data, в который поместите только файлы, содержащие в названии "txt".

data = []
files = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']
for file in files:
    if file.endswith('.txt'):
        data.append(file)
print(data)

['ratings.txt', 'stock_stats.txt', 'movies.txt']

In [96]:
# 3.12
for root, dirs, files in os.walk('csv/b3/data'):
    print(root, dirs, files)

csv/data_b3 [] ['ratings_8.txt', 'ratings_9.txt', 'ratings_10.txt', 'ratings_7.txt', 'ratings_6.txt', 'ratings_4.txt', 'ratings_5.txt', 'ratings_1.txt', 'ratings_2.txt', 'ratings_3.txt']

In [99]:
# 3.13
dt13 = pd.DataFrame(columns = ['userId', 'movieId', 'rating', 'timestamp'])
for root, dirs, files in os.walk('csv/b3/data'):
    for file in files:
        if file.endswith('.txt'):
            temp = pd.read_csv(os.path.join(root, file), names = ['userId', 'movieId', 'rating', 'timestamp'])
            dt13 = pd.concat([dt13, temp])

print(dt13)

     userId movieId  rating   timestamp
0       483    1573     2.0  1465387568
1       483    1580     3.0  1465387435
2       483    1676     4.0  1465387586
3       483    1682     3.0  1465387384
4       483    1732     5.0  1465387406
...     ...     ...     ...         ...
9995    213   72701     2.5  1462644086
9996    213   72737     3.0  1462636677
9997    213   72919     2.5  1462637308
9998    213   72998     5.0  1462636393
9999    213   73015     2.0  1462636831

[100004 rows x 4 columns]

In [102]:
# 3.15.3
# Сколько раз была выставлена низшая оценка 0.5 в наших рейтингах? Используйте файл ratings.csv.
len(ratings[ratings['rating'] == 0.5])

1370

In [104]:
# 3.15.4
# Объедините датафреймы ratings и movies, используя параметр how='outer'.
# Сколько строк в получившемся датафрейме?
outer_rating = ratings.merge(movies, on='movieId', how='outer')
print(outer_rating)

        userId  movieId  rating     timestamp  \
0          1.0        1     4.0  9.649827e+08
1          5.0        1     4.0  8.474350e+08
2          7.0        1     4.5  1.106636e+09
3         15.0        1     2.5  1.510578e+09
4         17.0        1     4.5  1.305696e+09
...        ...      ...     ...           ...
100849     NaN    30892     NaN           NaN
100850     NaN    32160     NaN           NaN
100851     NaN    32371     NaN           NaN
100852     NaN    34482     NaN           NaN
100853     NaN    85565     NaN           NaN

                                     title  \
0                         Toy Story (1995)
1                         Toy Story (1995)
2                         Toy Story (1995)
3                         Toy Story (1995)
4                         Toy Story (1995)
...                                    ...
100849  In the Realms of the Unreal (2004)
100850            Twentieth Century (1934)
100851           Call Northside 777 (1948)
100852        Browning Version, The (1951)
100853                  Chalet Girl (2011)

                                             genres
0       Adventure|Animation|Children|Comedy|Fantasy
1       Adventure|Animation|Children|Comedy|Fantasy
2       Adventure|Animation|Children|Comedy|Fantasy
3       Adventure|Animation|Children|Comedy|Fantasy
4       Adventure|Animation|Children|Comedy|Fantasy
...                                             ...
100849                        Animation|Documentary
100850                                       Comedy
100851                        Crime|Drama|Film-Noir
100852                                        Drama
100853                               Comedy|Romance

[100854 rows x 6 columns]

In [109]:
# 3.15.5
# Найдите в датафрейме movies фильм с movieId=3456.
# Какой у него год выпуска?
# P. S. Попробуйте найти movieId этого фильма в датафрейме ratings. 
# Это будет ключом к ответу на следующее задание.
movies[movies['movieId'] == 3456]

      movieId                                         title genres
2587     3456  Color of Paradise, The (Rang-e khoda) (1999)  Drama